src/Reports/ТоварныйОтчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>ТоварныйОтчет</Name>
			<Comment>Товарный отчет (ТОРГ-29)</Comment>
		</Properties>
	</Report>
</MetaDataObject>

src/AccumulationRegisters/ОстаткиТоваровКомпании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТоваровКомпании</Name>
			<Comment>Блок учета остатков товаров компании</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количественный остаток номенклатуры на складе</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Резерв</Name>
					<Comment>Количество зарезервированного товара на складе</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРозн</Name>
					<Comment>Розничная сумма в валюте регламентированного учета с налогами</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПереоценки</Name>
					<Comment>Количество переоцененного товара</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Comment>Цена после переоценки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Контрагент или подразделение получатель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСкидки</Name>
					<Comment>Сумма скидки в валюте регл. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/ПартииТоваровКомпании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ПартииТоваровКомпании</Name>
			<Comment>Блок учета партий товаров компании собственных и принятых на комиссию</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количественный остаток товара на складе в разрезе партий</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма в валюте регламентированного учета с налогами</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Comment>Сумма НДС в валюте регламентированного учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБезНДС</Name>
					<Comment>Сумма в валюте регламентированного учета без налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте управленческого учета с налогами</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДСУпр</Name>
					<Comment>Сумма НДС в валюте управленческого учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБезНДСУпр</Name>
					<Comment>Сумма в валюте управленческого учета без налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>Ставка НДС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Comment>Проект</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПродажи</Name>
					<Comment>Документ продажи</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияАктивов</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионера</v8:Type>
						<v8:Type>cfg:DocumentRef.Инвентаризация</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеСмены</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусПартии</Name>
					<Comment>Статус партии, определяющий, чей товар (купленный компанией или принятый на комиссию)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПартий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Comment>Партия, по которой поступил или был взят на комиссию товар</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыПартий</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Enums/ВидыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыНоменклатуры</Name>
			<Comment>Виды номенклатуры</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
					<Comment>Основной вид ТМЦ, учитываемый на складах</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
					<Comment>Не хранится на складах, используется для отнесения суммы услуг на себестоимость или доходы и расходы</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Комплект</Name>
					<Comment>Вид ТМЦ, хранимый на складах и комплектуемый из других ТМЦ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Тара</Name>
					<Comment>Вид ТМЦ, хранимый на складе и возвращаемый поставщику</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Набор</Name>
					<Comment>Вид ТМЦ не хранимый на складе и предназначенный для группового прихода / расхода номенклатуры</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеАктивы</Name>
					<Comment>Прочие активы</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продукция</Name>
					<Comment>Продукция</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Skype</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ХозОперации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ХозОперации</Name>
			<Comment>Хозяйственные операции. Содержит предопределенный классификатор операций и видов проводок конфигурации</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Comment>Вид операции</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийДоговора</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комиссия</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВидыНоменклатуры</Name>
					<Comment>Виды номенклатуры</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидНоменклатуры</Name>
							<Comment>Вид номенклатуры</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыДоговоров</Name>
					<Comment>Виды договоров</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДоговора</Name>
							<Comment>Вид договора</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыДоговоров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Reports/ТоварныйОтчет/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

//// Модуль отчета
//
//////////////////////////////////////////////////////////////////////////////////
//// ПЕРЕМЕННЫЕ ОБЪЕКТА
// Перем МакетОтчета, ОформлениеСтроки;     // переменные объекта
// Перем ТаблицаПриход,ТаблицаРасход;       // переменные объекта
// Перем СоответствиеХозОперацийПереоценки; // переменные объекта.

//////////////////////////////////////////////////////////////////////////////////
//// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Формирует текст запроса
//
// Параметры
//   Реж - строка - режим запроса (Движения, Остатки).
//
// Возвращаемое значение:
//   ТекстЗапроса - текст
//
Функция ПолучитьТекстЗапроса(Реж, ВидПоказателя, Знач ТекстОтбора)
	// формируем строку фильтров виртуальной таблицы
	
	Если Реж="Движения" Тогда
		ТекстОтбора = ?(ТекстОтбора = "", "", " И "+ТекстОтбора);
		Если ВидПоказателя = "СуммаПродажи" Тогда
			ТекстОтбора = СтрЗаменить(ТекстОтбора, "#ИмяТаблицы#.", "ОстаткиТоваров.");
			ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ОстаткиТоваров.СкладКомпании КАК СкладКомпании,
			|	ОстаткиТоваров.Регистратор КАК Регистратор,
			|	ОстаткиТоваров.Период КАК ДатаДок,
			|	ОстаткиТоваров.ХозОперация КАК ХозОперация,
			|	СУММА(ВЫБОР КОГДА ОстаткиТоваров.Номенклатура.ВидНоменклатуры<>&Тара ТОГДА ОстаткиТоваров.СуммаРозн ИНАЧЕ 0 КОНЕЦ) КАК ТоварСумма,
			|	СУММА(ВЫБОР КОГДА ОстаткиТоваров.Номенклатура.ВидНоменклатуры=&Тара ТОГДА ОстаткиТоваров.СуммаРозн ИНАЧЕ 0 КОНЕЦ) КАК ТараСумма
			|ИЗ
			|	РегистрНакопления.ОстаткиТоваровКомпании КАК ОстаткиТоваров
			|ГДЕ
			|	ОстаткиТоваров.Период МЕЖДУ &ДатаНачала И &ДатаКонца
			|	И ОстаткиТоваров.ВидДвижения=&ВидДвижения
			|	"+ТекстОтбора+"
			|СГРУППИРОВАТЬ ПО 
			|	ОстаткиТоваров.СкладКомпании,
			|	ОстаткиТоваров.Регистратор,
			|	ОстаткиТоваров.ХозОперация,
			|	ОстаткиТоваров.Период
			|ИМЕЮЩИЕ
			|	СУММА(ЕСТЬNULL(ОстаткиТоваров.СуммаРозн,0))<>0
			|УПОРЯДОЧИТЬ ПО
			|   СкладКомпании,
			|	ДатаДок,
			|	Регистратор,
			|	ХозОперация ВОЗР";
		Иначе
			// Отбор партий
			СтрокаУсловияПартийТоваров = СтрЗаменить(ТекстОтбора, "#ИмяТаблицы#.", "ПартииТоваровКомпании.");
			
			ТекстЗапроса = "
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ПартииТоваровКомпании.Регистратор КАК Регистратор,
			|	ПартииТоваровКомпании.СкладКомпании КАК СкладКомпании,			
			|	ПартииТоваровКомпании.Период КАК ДатаДок,
			|	ПартииТоваровКомпании.ХозОперация КАК ХозОперация,
			|	СУММА(ВЫБОР КОГДА ПартииТоваровКомпании.Номенклатура.ВидНоменклатуры<>&Тара ТОГДА ЕСТЬNULL(ПартииТоваровКомпании.Сумма, 0)"+?(ВидПоказателя="БезНДС","-ЕСТЬNULL(ПартииТоваровКомпании.СуммаНДС, 0)","")+" ИНАЧЕ 0 КОНЕЦ) КАК ТоварСумма,
			|	СУММА(ВЫБОР КОГДА ПартииТоваровКомпании.Номенклатура.ВидНоменклатуры=&Тара ТОГДА ЕСТЬNULL(ПартииТоваровКомпании.Сумма, 0)"+?(ВидПоказателя="БезНДС","-ЕСТЬNULL(ПартииТоваровКомпании.СуммаНДС, 0)","")+" ИНАЧЕ 0 КОНЕЦ) КАК ТараСумма
			|ИЗ
			|	РегистрНакопления.ПартииТоваровКомпании КАК ПартииТоваровКомпании
			|ГДЕ
			|	ПартииТоваровКомпании.Период МЕЖДУ &ДатаНачала И &ДатаКонца
			|	И ПартииТоваровКомпании.ВидДвижения=&ВидДвижения
			|	"+СтрокаУсловияПартийТоваров+"
			|СГРУППИРОВАТЬ ПО
			|	ПартииТоваровКомпании.СкладКомпании,
			|	ПартииТоваровКомпании.Регистратор,
			|	ПартииТоваровКомпании.ХозОперация,
			|	ПартииТоваровКомпании.Период
			|УПОРЯДОЧИТЬ ПО
			|   СкладКомпании,
			|	ДатаДок,
			|	Регистратор,
			|	ХозОперация";
		КонецЕсли;
		
	ИначеЕсли Реж="Остатки" Тогда
		// формируем текст запроса
		ТекстОтбора = СтрЗаменить(ТекстОтбора, "#ИмяТаблицы#.", "");
		Если ВидПоказателя = "СуммаПродажи" Тогда
			ТекстЗапроса="ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|   ОстаткиТоваров.СкладКомпании КАК СкладКомпании,
			|	СУММА(ВЫБОР КОГДА ОстаткиТоваров.Номенклатура.ВидНоменклатуры <> &Тара ТОГДА ОстаткиТоваров.СуммаРознОстаток ИНАЧЕ 0 КОНЕЦ) КАК ТоварСумма,
			|	СУММА(ВЫБОР КОГДА ОстаткиТоваров.Номенклатура.ВидНоменклатуры = &Тара ТОГДА ОстаткиТоваров.СуммаРознОстаток ИНАЧЕ 0 КОНЕЦ) КАК ТараСумма
			|ИЗ
			|	РегистрНакопления.ОстаткиТоваровКомпании.Остатки(&НаДату, "+ТекстОтбора+") КАК ОстаткиТоваров
			|СГРУППИРОВАТЬ ПО
			|	ОстаткиТоваров.СкладКомпании";
		Иначе
			ТекстЗапроса="ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ПартииТоваровКомпании.СкладКомпании КАК СкладКомпании,
			|	СУММА(ВЫБОР КОГДА ПартииТоваровКомпании.Номенклатура.ВидНоменклатуры <> &Тара ТОГДА ЕСТЬNULL(ПартииТоваровКомпании.СуммаОстаток, 0)"+?(ВидПоказателя="БезНДС","-ЕСТЬNULL(ПартииТоваровКомпании.СуммаНДСОстаток, 0)","")+" ИНАЧЕ 0 КОНЕЦ) КАК ТоварСумма,
			|	СУММА(ВЫБОР КОГДА ПартииТоваровКомпании.Номенклатура.ВидНоменклатуры = &Тара ТОГДА ЕСТЬNULL(ПартииТоваровКомпании.СуммаОстаток, 0)"+?(ВидПоказателя="БезНДС","-ЕСТЬNULL(ПартииТоваровКомпании.СуммаНДСОстаток, 0)","")+" ИНАЧЕ 0 КОНЕЦ) КАК ТараСумма
			|ИЗ
			|	РегистрНакопления.ПартииТоваровКомпании.Остатки(&НаДату, "+ТекстОтбора+") КАК ПартииТоваровКомпании
			|СГРУППИРОВАТЬ ПО
			|	ПартииТоваровКомпании.СкладКомпании";
		КонецЕсли;
		
	ИначеЕсли Реж="Склады" Тогда
		// формируем текст запроса
		ТекстОтбора = СтрЗаменить(ТекстОтбора, "#ИмяТаблицы#.", "");
			ТекстЗапроса="ВЫБРАТЬ РАЗРЕШЕННЫЕ
			             |	ПартииТоваровКомпанииОстаткиИОбороты.СкладКомпании КАК СкладКомпании
			             |ИЗ
			             |	РегистрНакопления.ПартииТоваровКомпании.ОстаткиИОбороты(&ДатаНачала, &ДатаКонца, , , "+ТекстОтбора+") КАК ПартииТоваровКомпанииОстаткиИОбороты
			             |
			             |СГРУППИРОВАТЬ ПО
			             |	ПартииТоваровКомпанииОстаткиИОбороты.СкладКомпании";
		
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции // ПолучитьТекстЗапроса()

// Стандартная процедура настройки схемы компоновщика данных
//
Процедура ЗаполнитьНачальныеНастройки() Экспорт
	
	Зарезервировано = Истина;
	
КонецПроцедуры

Процедура ПриИзмененииНастроек(ФормаОтчета) Экспорт
	
	ВидСуммы = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВидСуммы"));
	Если НЕ ЗначениеЗаполнено(ВидСуммы.Значение) Тогда
		ВидСуммы.Значение = "Сумма";
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	
	ТаблицаДокументов = Новый ТаблицаЗначений;
	ТаблицаДокументов.Колонки.Добавить("Регистратор");
	
	ТаблицаДокументовРасход = Новый ТаблицаЗначений;
	ТаблицаДокументовРасход.Колонки.Добавить("Регистратор");
	

	СтандартнаяОбработка = Ложь;
	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	
	ВидПоказателя = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВидСуммы")).Значение;
	НомерОтчета   = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("НомерОтчета")).Значение;
	НачалоПериода = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("НачалоПериода")).Значение;
	КонецПериода  = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("КонецПериода")).Значение;
	
	Если ТипЗнч(НачалоПериода) = Тип("СтандартнаяДатаНачала") Тогда
		НачалоПериода = НачалоПериода.Дата;
	КонецЕсли;	
	
	Если ТипЗнч(КонецПериода) = Тип("СтандартнаяДатаНачала") Тогда
		КонецПериода = КонецПериода.Дата;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	ТекстОтбора = ОтчетыПлатформаСервер.КомпоновщикПолучитьТекстОтбора(Настройки.Отбор.Элементы, Настройки.Отбор.ДоступныеПоляОтбора, "#ИмяТаблицы#", Запрос.Параметры);
	
	ПолеПоиска = Новый ПолеКомпоновкиДанных("СкладКомпании.Организация");
	ОтборОрганизация = ОтчетыПлатформаСервер.КомпоновщикНайтиОтбор(ПолеПоиска, Настройки.Отбор);
	
	ПолеПоиска = Новый ПолеКомпоновкиДанных("СкладКомпании");
	ОтборСкладКомпании = ОтчетыПлатформаСервер.КомпоновщикНайтиОтбор(ПолеПоиска, Настройки.Отбор);
	
	СоответствиеХозОперацийПереоценки=Новый Соответствие();
	СоответствиеХозОперацийПереоценки.Вставить(Справочники.ХозОперации.ПереоценкаРозницаПоПриходу,Истина);
	СоответствиеХозОперацийПереоценки.Вставить(Справочники.ХозОперации.ПереоценкаРозницаПоРасходу,Истина);
	СоответствиеХозОперацийПереоценки.Вставить(Справочники.ХозОперации.ПереоценкаТоваровВРознице,Истина);
		
	// Получим макеты для результата и оформления.
	МакетОтчета = ПолучитьМакет("Макет");
	
	// Если периоды указаны неверно: дата начала позже даты конца.
	Если НачалоПериода > КонецПериода Тогда
		ОбластьВыводаОшибки = МакетОтчета.ПолучитьОбласть("ОбластьВыводаОшибки");
		ОбластьВыводаОшибки.Параметры.Заголовок = НСтр("ru = 'Отчет не сформирован по причине:'");	
		ОбластьВыводаОшибки.Параметры.ТекстОшибки = 
			СтрШаблон(НСтр("ru = 'Неверно указан период отчета: дата начала периода %1 не может быть больше даты конца периода %2'"), 
			Формат(НачалоПериода, "ДЛФ=Д"), Формат(КонецПериода, "ДЛФ=Д"));
		ДокументРезультат.Вывести(ОбластьВыводаОшибки);
		Возврат;
	КонецЕсли;
	
	// ПОСТРОИМ ЗАГОЛОВОК
	
	// СОЗДАДИМ ЗАПРОС
	
	
	НомерДняГода = ДеньГода(НачалоПериода);
	Запрос.УстановитьПараметр("Тара", Перечисления.ВидыНоменклатуры.Тара);
	Запрос.УстановитьПараметр("НаДату", НачалоДня(НачалоПериода));
	Запрос.УстановитьПараметр("ДатаНачала",  НачалоДня(НачалоПериода));
	Запрос.УстановитьПараметр("ДатаКонца",   КонецДня(КонецПериода));
	
	Запрос.Текст = ПолучитьТекстЗапроса("Склады", ВидПоказателя, ТекстОтбора);
	ВыборкаСклады = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаСклады.Следующий() Цикл 
		Запрос.Текст = ПолучитьТекстЗапроса("Остатки", ВидПоказателя, ТекстОтбора);
		ВыборкаОст = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		
			НомерДняГода = НомерДняГода + 1;
			
			НомерОтчета = НомерДняГода;
			
			ДопСекция = "|Начало";
			ОбластьЗаголовка = МакетОтчета.ПолучитьОбласть("Шапка"+ДопСекция);
			
			//// Организация
			//Если (НЕ ОтборОрганизация = Неопределено) И ОтборОрганизация.Использование И ОтборОрганизация.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно И ЗначениеЗаполнено(ОтборОрганизация.ПравоеЗначение) Тогда
			//	
			//	Организация = ОтборОрганизация.ПравоеЗначение;
			//	
			//	Телефон = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Организация, Перечисления.ТипыКонтактнойИнформации.Телефон);
			//	
			//	ОбластьЗаголовка.Параметры.Заголовок = СокрЛП(Организация.НаименованиеПолное)
			//	+?(Организация.ИНН = "","",", ИНН "+СокрЛП(Организация.ИНН))+?(Телефон = "","",", "+Телефон);
			//Иначе
			//	ОбластьЗаголовка.Параметры.Заголовок = "<" + НСтр("ru = 'по нескольким организациям'") + ">";
			//КонецЕсли;
			//
			//// Склад
			//Если (НЕ ОтборСкладКомпании = Неопределено) И ОтборСкладКомпании.Использование И ОтборСкладКомпании.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно И ЗначениеЗаполнено(ОтборСкладКомпании.ПравоеЗначение) Тогда
			//	
			//	СкладКомпании = ОтборСкладКомпании.ПравоеЗначение;
			//	
			//	ОбластьЗаголовка.Параметры.ПечСклад = СкладКомпании.Наименование;
			//	ОбластьЗаголовка.Параметры.ПечМОЛ = СкладКомпании.МОЛ;
			//	
			//Иначе
			//	
			//	ОбластьЗаголовка.Параметры.ПечСклад = "<" + НСтр("ru = 'по нескольким складам'") + ">";
			//	ОбластьЗаголовка.Параметры.ПечМОЛ = "";
			//	
			//КонецЕсли;
			
			
			Организация = ВыборкаСклады.СкладКомпании.ПодразделениеКомпании.Организация;
			
			Телефон = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Организация, Перечисления.ТипыКонтактнойИнформации.Телефон);
			
			ОбластьЗаголовка.Параметры.Заголовок = СокрЛП(Организация.НаименованиеПолное)
			+?(Организация.ИНН = "","",", ИНН "+СокрЛП(Организация.ИНН))+?(Телефон = "","",", "+Телефон);
			
			СкладКомпании = ВыборкаСклады.СкладКомпании;
			
			ОбластьЗаголовка.Параметры.ПечСклад = СкладКомпании.Наименование;
			ОбластьЗаголовка.Параметры.ПечМОЛ = СкладКомпании.МОЛ;
			
			
			
			ОбластьЗаголовка.Параметры.НомерОтчета     = НомерОтчета;
			ОбластьЗаголовка.Параметры.ДатаСоставления = ТекущаяДатаСеанса();
			ОбластьЗаголовка.Параметры.ДатаНачала      = НачалоПериода;
			ОбластьЗаголовка.Параметры.ДатаКонца       = КонецПериода;
			ДокументРезультат.Вывести(ОбластьЗаголовка);
			
			ОбластьСтрока     = МакетОтчета.ПолучитьОбласть("Строка"+ДопСекция);
			ОбластьПереоценка = МакетОтчета.ПолучитьОбласть("Переоценка"+ДопСекция);
			
			ТоварНачОст = 0;
			ТараНачОст  = 0;
			
			//Пока ВыборкаОст.Следующий() Цикл
			Если  ВыборкаОст.НайтиСледующий(Новый Структура("СкладКомпании",ВыборкаСклады.СКладКомпании)) Тогда
				// НАЧАЛЬНЫЙ ОСТАТОК
				ОбластьНачальныйОстаток = МакетОтчета.ПолучитьОбласть("НачальныйОстаток"+ДопСекция);
				
				// НАЧАЛЬНЫЙ ОСТАТОК ПО ТОВАРАМ
				
				ТоварНачОст = ?(ВыборкаОст.ТоварСумма = NULL, 0, ВыборкаОст.ТоварСумма);
				ТараНачОст  = ?(ВыборкаОст.ТараСумма = NULL, 0, ВыборкаОст.ТараСумма);
				
				// Вывод начальных остатков
				ОбластьНачальныйОстаток.Параметры.Товар = ТоварНачОст;
				ОбластьНачальныйОстаток.Параметры.Тара  = ТараНачОст;
				ОбластьНачальныйОстаток.Параметры.СтрОстатокНаНачало= НСтр("ru = 'Остаток на'") + " "+Формат(НачалоПериода,"ДЛФ=D");
				ДокументРезультат.Вывести(ОбластьНачальныйОстаток);
			Иначе
				// НАЧАЛЬНЫЙ ОСТАТОК
				ОбластьНачальныйОстаток = МакетОтчета.ПолучитьОбласть("НачальныйОстаток"+ДопСекция);
				
				// Вывод начальных остатков
				ОбластьНачальныйОстаток.Параметры.Товар = "0,00";
				ОбластьНачальныйОстаток.Параметры.Тара  = "0,00";
				ОбластьНачальныйОстаток.Параметры.СтрОстатокНаНачало= НСтр("ru = 'Остаток на'") + " "+Формат(НачалоПериода,"ДЛФ=D");
				ДокументРезультат.Вывести(ОбластьНачальныйОстаток);			
			КонецЕсли;
			
			// ПРИХОД
			ОбластьЗаголовокПриход = МакетОтчета.ПолучитьОбласть("ЗаголовокПриход"+ДопСекция);
			ДокументРезультат.Вывести(ОбластьЗаголовокПриход);
			
			Запрос.Текст = ПолучитьТекстЗапроса("Движения", ВидПоказателя, ТекстОтбора);
			Запрос.УстановитьПараметр("ДатаНачала",  НачалоДня(НачалоПериода));
			Запрос.УстановитьПараметр("ДатаКонца",   КонецДня(КонецПериода));
			Запрос.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Приход);
			
			// Идем по выборке и заполняем временные таблицы
			ТоварПриход=0; ТараПриход=0;
			НомерСтроки = 1;
			//ВыборкаСклады = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"СкладКомпании");
			//Пока ВыборкаСклады.НайтиСледующий(Новый Структура("СкладКомпании",ВыборкаОст.СКладКомпании)) Цикл
			Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока Выборка.НайтиСледующий(Новый Структура("СкладКомпании",ВыборкаСклады.СКладКомпании)) Цикл
				
				//Выборка = ВыборкаСклады.Выбрать();
				//Пока Выборка.Следующий() Цикл
				ТекОбласть=?(СоответствиеХозОперацийПереоценки[Выборка.ХозОперация]=Неопределено,ОбластьСтрока, ОбластьПереоценка);
				ТекОбласть.Параметры.ДатаДок  = Выборка.Регистратор.Дата;
				ТекОбласть.Параметры.НомерДок = Выборка.Регистратор.Номер;
				ТекОбласть.Параметры.НомерСтроки = НомерСтроки;
				
				НомерСтроки = НомерСтроки + 1;
				
				Попытка
					НаименованиеКонтрагента = ?(ЗначениеЗаполнено(Выборка.Регистратор.Контрагент), Выборка.Регистратор.Контрагент, "");
				Исключение
					НаименованиеКонтрагента="";
				КонецПопытки;
				
				ПредстДок  = СокрЛП(Выборка.ХозОперация)+": "+НаименованиеКонтрагента;
				ТоварСумма = ?(Выборка.ТоварСумма = NULL, 0, Выборка.ТоварСумма);
				ТараСумма  = ?(Выборка.ТараСумма = NULL, 0, Выборка.ТараСумма);
				
				ТекОбласть.Параметры.Представление = ПредстДок;
				ТекОбласть.Параметры.Товар = ТоварСумма;
				ТекОбласть.Параметры.Тара  = ТараСумма;
				
				ТекОбласть.Область("R1C1").Расшифровка = Выборка.Регистратор;
				
				ДокументРезультат.Вывести(ТекОбласть);
				
				ТоварПриход = ТоварПриход+ТоварСумма;
				ТараПриход = ТараПриход+ТараСумма;
				
				стрТаблицаДокументов = ТаблицаДокументов.Добавить();
				стрТаблицаДокументов.Регистратор = Выборка.Регистратор;
				//КонецЦикла;
			КонецЦикла;
			
			// Для подсчета количества документов. 
			//ТаблицаДокументов = Запрос.Выполнить().Выгрузить();
			ТаблицаДокументов.Свернуть("Регистратор");
			
			ОбластьИтогоПриход = МакетОтчета.ПолучитьОбласть("ИтогПриход"+ДопСекция);
			ОбластьИтогоПриход.Параметры.Товар = ТоварПриход;
			ОбластьИтогоПриход.Параметры.Тара  = ТараПриход;
			ДокументРезультат.Вывести(ОбластьИтогоПриход);
			
			ОбластьИтогоПриходОстаток = МакетОтчета.ПолучитьОбласть("ПриходСОстатком"+ДопСекция);
			ОбластьИтогоПриходОстаток.Параметры.Товар = ТоварПриход+ТоварНачОст;
			ОбластьИтогоПриходОстаток.Параметры.Тара = ТараПриход+ТараНачОст;
			ДокументРезультат.Вывести(ОбластьИтогоПриходОстаток);
			
			// РАСХОД
			ОбластьЗаголовокРасход = МакетОтчета.ПолучитьОбласть("ЗаголовокРасход"+ДопСекция);
			ДокументРезультат.Вывести(ОбластьЗаголовокРасход);
			
			Запрос.Текст = ПолучитьТекстЗапроса("Движения", ВидПоказателя, ТекстОтбора);
			Запрос.УстановитьПараметр("ВидДвижения",ВидДвиженияНакопления.Расход);
			
			// Идем по выборке и заполняем временные таблицы.
			ТоварРасход=0; ТараРасход=0;
			НомерСтроки = 1;
			
			Выборка=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			//ВыборкаСклады = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"СкладКомпании");
			//Пока ВыборкаСклады.НайтиСледующий(Новый Структура("СкладКомпании",ВыборкаОст.СКладКомпании)) Цикл
			
			Пока Выборка.НайтиСледующий(Новый Структура("СкладКомпании",ВыборкаСклады.СКладКомпании)) Цикл
				
				ТекОбласть=?(СоответствиеХозОперацийПереоценки[Выборка.ХозОперация]=Неопределено, ОбластьСтрока, ОбластьПереоценка);
				ТекОбласть.Параметры.ДатаДок  = Выборка.Регистратор.Дата;
				ТекОбласть.Параметры.НомерДок = Выборка.Регистратор.Номер;
				ТекОбласть.Параметры.НомерСтроки = НомерСтроки;
				
				НомерСтроки = НомерСтроки + 1;
				
				Попытка
					НаименованиеКонтрагента = ?(ЗначениеЗаполнено(Выборка.Регистратор.Контрагент), Выборка.Регистратор.Контрагент, "");
				Исключение
					НаименованиеКонтрагента="";
				КонецПопытки;
				
				ПредстДок  = СокрЛП(Выборка.ХозОперация)+": "+НаименованиеКонтрагента;
				ТоварСумма = ?(Выборка.ТоварСумма = NULL, 0, Выборка.ТоварСумма);
				ТараСумма  = ?(Выборка.ТараСумма = NULL, 0, Выборка.ТараСумма);
				
				ТекОбласть.Параметры.Представление = ПредстДок;
				ТекОбласть.Параметры.Товар = ТоварСумма;
				ТекОбласть.Параметры.Тара = ТараСумма;
				
				ТекОбласть.Область("R1C1").Расшифровка=Выборка.Регистратор;
				
				ДокументРезультат.Вывести(ТекОбласть);
				
				ТоварРасход = ТоварРасход+ТоварСумма;
				ТараРасход = ТараРасход+ТараСумма;
				//КонецЦикла;
			КонецЦикла;
			
			// Для подсчета количества документов.
			//ТаблицаДокументовРасход = Запрос.Выполнить().Выгрузить();
			ТаблицаДокументовРасход.Свернуть("Регистратор");
			
			Для Каждого Строка Из ТаблицаДокументовРасход Цикл
				СтрокаТаблицыДокументов = ТаблицаДокументов.Добавить();
				СтрокаТаблицыДокументов.Регистратор = Строка.Регистратор;
			КонецЦикла;
			
			ТаблицаДокументов.Свернуть("Регистратор");
			
			ОбластьИтогоРасход = МакетОтчета.ПолучитьОбласть("ИтогРасход"+ДопСекция);
			ОбластьИтогоРасход.Параметры.Товар = ТоварРасход;
			ОбластьИтогоРасход.Параметры.Тара  = ТараРасход;
			ДокументРезультат.Вывести(ОбластьИтогоРасход);
			
			// КОНЕЧНЫЙ ОСТАТОК
			ДатаКонДляОстатка = Новый Граница(КонецДня(КонецПериода), ВидГраницы.Включая);
			Запрос.УстановитьПараметр("НаДату", ДатаКонДляОстатка);
			//Запрос.УстановитьПараметр("СкладКомпании", ВыборкаОст.СКладКомпании);
			
			//ТекстОтбора = "СкладКомпании = &СкладКомпании";
			// КОНЕЧНЫЙ ОСТАТОК ПО ТОВАРАМ
			Запрос.Текст = ПолучитьТекстЗапроса("Остатки", ВидПоказателя, ТекстОтбора);
			ВыборкаОстКон = Запрос.Выполнить().Выбрать();
			ВыборкаОстКон.НайтиСледующий(Новый Структура("СкладКомпании",ВыборкаСклады.СКладКомпании));
			ОбластьКонечныйОстаток = МакетОтчета.ПолучитьОбласть("КонечныйОстаток"+ДопСекция);
			ТоварКонОст = ?(Выборка.ТоварСумма=NULL,0,ВыборкаОстКон.ТоварСумма);
			ТараКонОст = ?(Выборка.ТараСумма=NULL,0,ВыборкаОстКон.ТараСумма);
			
			// Вывод конечных остатков
			ОбластьКонечныйОстаток.Параметры.Товар = ТоварКонОст;
			ОбластьКонечныйОстаток.Параметры.Тара  = ТараКонОст;
			ОбластьКонечныйОстаток.Параметры.СтрОстатокНаКонец= НСтр("ru = 'Остаток на'") + " "+Формат(КонецПериода,"ДЛФ=D");
			ДокументРезультат.Вывести(ОбластьКонечныйОстаток);
			
			// ПОДВАЛ
			ОбластьПодвал = МакетОтчета.ПолучитьОбласть("Подвал"+ДопСекция);
			ОбластьПодвал.Параметры.ИтогоДок=ЧислоПрописью(ТаблицаДокументов.Количество(),,"документ, документа, документов, м, , , , м, 0");
			ДокументРезультат.Вывести(ОбластьПодвал);
			
	КонецЦикла;
	
	ДокументРезультат.АвтоМасштаб=Истина;
	ДокументРезультат.ТолькоПросмотр=Истина;
	
КонецПроцедуры

Функция ПолучитьНедоступныеНастройки() Экспорт
	
	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("Группировки");
	СтруктураПолей.Вставить("Показатели");
	СтруктураПолей.Вставить("Порядок");
	СтруктураПолей.Вставить("Таблицы");
	
	Возврат СтруктураПолей;
	
КонецФункции

#КонецЕсли
